TexasInstruments/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/peripherals/hw_gpio.h
/* GPIO_DIN15_12 Bits */
/* GPIO_DIN15_12[DIO12] Bits */
#define GPIO_DIN15_12_DIO12_OFS                  (0)                             /* !< DIO12 Offset */
#define GPIO_DIN15_12_DIO12_MASK                 ((uint32_t)0x00000001U)         /* !< This bit reads the data input value
                                                                                    of DIO12. */
#define GPIO_DIN15_12_DIO12_ZERO                 ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIO_DIN15_12_DIO12_ONE                  ((uint32_t)0x00000001U)         /* !< Input value is 1 */
/* GPIO_DIN15_12[DIO13] Bits */
#define GPIO_DIN15_12_DIO13_OFS                  (8)                             /* !< DIO13 Offset */
#define GPIO_DIN15_12_DIO13_MASK                 ((uint32_t)0x00000100U)         /* !< This bit reads the data input value
                                                                                    of DIO13. */
#define GPIO_DIN15_12_DIO13_ZERO                 ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIO_DIN15_12_DIO13_ONE                  ((uint32_t)0x00000100U)         /* !< Input value is 1 */
/* GPIO_DIN15_12[DIO14] Bits */
#define GPIO_DIN15_12_DIO14_OFS                  (16)                            /* !< DIO14 Offset */
#define GPIO_DIN15_12_DIO14_MASK                 ((uint32_t)0x00010000U)         /* !< This bit reads the data input value
                                                                                    of DIO14. */
#define GPIO_DIN15_12_DIO14_ZERO                 ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIO_DIN15_12_DIO14_ONE                  ((uint32_t)0x00010000U)         /* !< Input value is 1 */
/* GPIO_DIN15_12[DIO15] Bits */
#define GPIO_DIN15_12_DIO15_OFS                  (24)                            /* !< DIO15 Offset */
#define GPIO_DIN15_12_DIO15_MASK                 ((uint32_t)0x01000000U)         /* !< This bit reads the data input value
                                                                                    of DIO15. */
#define GPIO_DIN15_12_DIO15_ZERO                 ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIO_DIN15_12_DIO15_ONE                  ((uint32_t)0x01000000U)         /* !< Input value is 1 */

/* GPIO_DIN19_16 Bits */
/* GPIO_DIN19_16[DIO16] Bits */
#define GPIO_DIN19_16_DIO16_OFS                  (0)                             /* !< DIO16 Offset */
#define GPIO_DIN19_16_DIO16_MASK                 ((uint32_t)0x00000001U)         /* !< This bit reads the data input value
                                                                                    of DIO16. */
#define GPIO_DIN19_16_DIO16_ZERO                 ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIO_DIN19_16_DIO16_ONE                  ((uint32_t)0x00000001U)         /* !< Input value is 1 */
/* GPIO_DIN19_16[DIO17] Bits */
#define GPIO_DIN19_16_DIO17_OFS                  (8)                             /* !< DIO17 Offset */
#define GPIO_DIN19_16_DIO17_MASK                 ((uint32_t)0x00000100U)         /* !< This bit reads the data input value
                                                                                    of DIO17. */
#define GPIO_DIN19_16_DIO17_ZERO                 ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIO_DIN19_16_DIO17_ONE                  ((uint32_t)0x00000100U)         /* !< Input value is 1 */
/* GPIO_DIN19_16[DIO18] Bits */
#define GPIO_DIN19_16_DIO18_OFS                  (16)                            /* !< DIO18 Offset */
#define GPIO_DIN19_16_DIO18_MASK                 ((uint32_t)0x00010000U)         /* !< This bit reads the data input value
                                                                                    of DIO18. */
#define GPIO_DIN19_16_DIO18_ZERO                 ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIO_DIN19_16_DIO18_ONE                  ((uint32_t)0x00010000U)         /* !< Input value is 1 */
/* GPIO_DIN19_16[DIO19] Bits */
#define GPIO_DIN19_16_DIO19_OFS                  (24)                            /* !< DIO19 Offset */
#define GPIO_DIN19_16_DIO19_MASK                 ((uint32_t)0x01000000U)         /* !< This bit reads the data input value
                                                                                    of DIO19. */
#define GPIO_DIN19_16_DIO19_ZERO                 ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIO_DIN19_16_DIO19_ONE                  ((uint32_t)0x01000000U)         /* !< Input value is 1 */

/* GPIO_DIN23_20 Bits */
/* GPIO_DIN23_20[DIO20] Bits */
#define GPIO_DIN23_20_DIO20_OFS                  (0)                             /* !< DIO20 Offset */
#define GPIO_DIN23_20_DIO20_MASK                 ((uint32_t)0x00000001U)         /* !< This bit reads the data input value
                                                                                    of DIO20. */
#define GPIO_DIN23_20_DIO20_ZERO                 ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIO_DIN23_20_DIO20_ONE                  ((uint32_t)0x00000001U)         /* !< Input value is 1 */
/* GPIO_DIN23_20[DIO21] Bits */
#define GPIO_DIN23_20_DIO21_OFS                  (8)                             /* !< DIO21 Offset */
#define GPIO_DIN23_20_DIO21_MASK                 ((uint32_t)0x00000100U)         /* !< This bit reads the data input value
                                                                                    of DIO21. */
#define GPIO_DIN23_20_DIO21_ZERO                 ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIO_DIN23_20_DIO21_ONE                  ((uint32_t)0x00000100U)         /* !< Input value is 1 */
/* GPIO_DIN23_20[DIO22] Bits */
#define GPIO_DIN23_20_DIO22_OFS                  (16)                            /* !< DIO22 Offset */
#define GPIO_DIN23_20_DIO22_MASK                 ((uint32_t)0x00010000U)         /* !< This bit reads the data input value
                                                                                    of DIO22. */
#define GPIO_DIN23_20_DIO22_ZERO                 ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIO_DIN23_20_DIO22_ONE                  ((uint32_t)0x00010000U)         /* !< Input value is 1 */
/* GPIO_DIN23_20[DIO23] Bits */
#define GPIO_DIN23_20_DIO23_OFS                  (24)                            /* !< DIO23 Offset */
#define GPIO_DIN23_20_DIO23_MASK                 ((uint32_t)0x01000000U)         /* !< This bit reads the data input value
                                                                                    of DIO23. */
#define GPIO_DIN23_20_DIO23_ZERO                 ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIO_DIN23_20_DIO23_ONE                  ((uint32_t)0x01000000U)         /* !< Input value is 1 */

