TexasInstruments/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/peripherals/hw_gpio.h
/* GPIO_POLARITY15_0 Bits */
/* GPIO_POLARITY15_0[DIO0] Bits */
#define GPIO_POLARITY15_0_DIO0_OFS               (0)                             /* !< DIO0 Offset */
#define GPIO_POLARITY15_0_DIO0_MASK              ((uint32_t)0x00000003U)         /* !< Enables and configures edge
                                                                                    detection polarity for DIO0. */
#define GPIO_POLARITY15_0_DIO0_DISABLE           ((uint32_t)0x00000000U)         /* !< Edge detection disabled */
#define GPIO_POLARITY15_0_DIO0_RISE              ((uint32_t)0x00000001U)         /* !< Detects rising edge of input event */
#define GPIO_POLARITY15_0_DIO0_FALL              ((uint32_t)0x00000002U)         /* !< Detects falling edge of input event */
#define GPIO_POLARITY15_0_DIO0_RISE_FALL         ((uint32_t)0x00000003U)         /* !< Detects both rising and falling
                                                                                    edge of input event */
/* GPIO_POLARITY15_0[DIO1] Bits */
#define GPIO_POLARITY15_0_DIO1_OFS               (2)                             /* !< DIO1 Offset */
#define GPIO_POLARITY15_0_DIO1_MASK              ((uint32_t)0x0000000CU)         /* !< Enables and configures edge
                                                                                    detection polarity for DIO1. */
#define GPIO_POLARITY15_0_DIO1_DISABLE           ((uint32_t)0x00000000U)         /* !< Edge detection disabled */
#define GPIO_POLARITY15_0_DIO1_RISE              ((uint32_t)0x00000004U)         /* !< Detects rising edge of input event */
#define GPIO_POLARITY15_0_DIO1_FALL              ((uint32_t)0x00000008U)         /* !< Detects falling edge of input event */
#define GPIO_POLARITY15_0_DIO1_RISE_FALL         ((uint32_t)0x0000000CU)         /* !< Detects both rising and falling
                                                                                    edge of input event */
/* GPIO_POLARITY15_0[DIO2] Bits */
#define GPIO_POLARITY15_0_DIO2_OFS               (4)                             /* !< DIO2 Offset */
#define GPIO_POLARITY15_0_DIO2_MASK              ((uint32_t)0x00000030U)         /* !< Enables and configures edge
                                                                                    detection polarity for DIO2. */
#define GPIO_POLARITY15_0_DIO2_DISABLE           ((uint32_t)0x00000000U)         /* !< Edge detection disabled */
#define GPIO_POLARITY15_0_DIO2_RISE              ((uint32_t)0x00000010U)         /* !< Detects rising edge of input event */
#define GPIO_POLARITY15_0_DIO2_FALL              ((uint32_t)0x00000020U)         /* !< Detects falling edge of input event */
#define GPIO_POLARITY15_0_DIO2_RISE_FALL         ((uint32_t)0x00000030U)         /* !< Detects both rising and falling
                                                                                    edge of input event */
/* GPIO_POLARITY15_0[DIO3] Bits */
#define GPIO_POLARITY15_0_DIO3_OFS               (6)                             /* !< DIO3 Offset */
#define GPIO_POLARITY15_0_DIO3_MASK              ((uint32_t)0x000000C0U)         /* !< Enables and configures edge
                                                                                    detection polarity for DIO3. */
#define GPIO_POLARITY15_0_DIO3_DISABLE           ((uint32_t)0x00000000U)         /* !< Edge detection disabled */
#define GPIO_POLARITY15_0_DIO3_RISE              ((uint32_t)0x00000040U)         /* !< Detects rising edge of input event */
#define GPIO_POLARITY15_0_DIO3_FALL              ((uint32_t)0x00000080U)         /* !< Detects falling edge of input event */
#define GPIO_POLARITY15_0_DIO3_RISE_FALL         ((uint32_t)0x000000C0U)         /* !< Detects both rising and falling
                                                                                    edge of input event */
/* GPIO_POLARITY15_0[DIO4] Bits */
#define GPIO_POLARITY15_0_DIO4_OFS               (8)                             /* !< DIO4 Offset */
#define GPIO_POLARITY15_0_DIO4_MASK              ((uint32_t)0x00000300U)         /* !< Enables and configures edge
                                                                                    detection polarity for DIO4. */
#define GPIO_POLARITY15_0_DIO4_DISABLE           ((uint32_t)0x00000000U)         /* !< Edge detection disabled */
#define GPIO_POLARITY15_0_DIO4_RISE              ((uint32_t)0x00000100U)         /* !< Detects rising edge of input event */
#define GPIO_POLARITY15_0_DIO4_FALL              ((uint32_t)0x00000200U)         /* !< Detects falling edge of input event */
#define GPIO_POLARITY15_0_DIO4_RISE_FALL         ((uint32_t)0x00000300U)         /* !< Detects both rising and falling
                                                                                    edge of input event */
/* GPIO_POLARITY15_0[DIO5] Bits */
#define GPIO_POLARITY15_0_DIO5_OFS               (10)                            /* !< DIO5 Offset */
#define GPIO_POLARITY15_0_DIO5_MASK              ((uint32_t)0x00000C00U)         /* !< Enables and configures edge
                                                                                    detection polarity for DIO5. */
#define GPIO_POLARITY15_0_DIO5_DISABLE           ((uint32_t)0x00000000U)         /* !< Edge detection disabled */
#define GPIO_POLARITY15_0_DIO5_RISE              ((uint32_t)0x00000400U)         /* !< Detects rising edge of input event */
#define GPIO_POLARITY15_0_DIO5_FALL              ((uint32_t)0x00000800U)         /* !< Detects falling edge of input event */
#define GPIO_POLARITY15_0_DIO5_RISE_FALL         ((uint32_t)0x00000C00U)         /* !< Detects both rising and falling
                                                                                    edge of input event */
/* GPIO_POLARITY15_0[DIO6] Bits */
#define GPIO_POLARITY15_0_DIO6_OFS               (12)                            /* !< DIO6 Offset */
#define GPIO_POLARITY15_0_DIO6_MASK              ((uint32_t)0x00003000U)         /* !< Enables and configures edge
                                                                                    detection polarity for DIO6. */
#define GPIO_POLARITY15_0_DIO6_DISABLE           ((uint32_t)0x00000000U)         /* !< Edge detection disabled */
#define GPIO_POLARITY15_0_DIO6_RISE              ((uint32_t)0x00001000U)         /* !< Detects rising edge of input event */
#define GPIO_POLARITY15_0_DIO6_FALL              ((uint32_t)0x00002000U)         /* !< Detects falling edge of input event */
#define GPIO_POLARITY15_0_DIO6_RISE_FALL         ((uint32_t)0x00003000U)         /* !< Detects both rising and falling
                                                                                    edge of input event */
/* GPIO_POLARITY15_0[DIO7] Bits */
#define GPIO_POLARITY15_0_DIO7_OFS               (14)                            /* !< DIO7 Offset */
#define GPIO_POLARITY15_0_DIO7_MASK              ((uint32_t)0x0000C000U)         /* !< Enables and configures edge
                                                                                    detection polarity for DIO7. */
#define GPIO_POLARITY15_0_DIO7_DISABLE           ((uint32_t)0x00000000U)         /* !< Edge detection disabled */
#define GPIO_POLARITY15_0_DIO7_RISE              ((uint32_t)0x00004000U)         /* !< Detects rising edge of input event */
#define GPIO_POLARITY15_0_DIO7_FALL              ((uint32_t)0x00008000U)         /* !< Detects falling edge of input event */
#define GPIO_POLARITY15_0_DIO7_RISE_FALL         ((uint32_t)0x0000C000U)         /* !< Detects both rising and falling
                                                                                    edge of input event */
/* GPIO_POLARITY15_0[DIO8] Bits */
#define GPIO_POLARITY15_0_DIO8_OFS               (16)                            /* !< DIO8 Offset */
#define GPIO_POLARITY15_0_DIO8_MASK              ((uint32_t)0x00030000U)         /* !< Enables and configures edge
                                                                                    detection polarity for DIO8. */
#define GPIO_POLARITY15_0_DIO8_DISABLE           ((uint32_t)0x00000000U)         /* !< Edge detection disabled */
#define GPIO_POLARITY15_0_DIO8_RISE              ((uint32_t)0x00010000U)         /* !< Detects rising edge of input event */
#define GPIO_POLARITY15_0_DIO8_FALL              ((uint32_t)0x00020000U)         /* !< Detects falling edge of input event */
#define GPIO_POLARITY15_0_DIO8_RISE_FALL         ((uint32_t)0x00030000U)         /* !< Detects both rising and falling
                                                                                    edge of input event */
/* GPIO_POLARITY15_0[DIO9] Bits */
#define GPIO_POLARITY15_0_DIO9_OFS               (18)                            /* !< DIO9 Offset */
#define GPIO_POLARITY15_0_DIO9_MASK              ((uint32_t)0x000C0000U)         /* !< Enables and configures edge
                                                                                    detection polarity for DIO9. */
#define GPIO_POLARITY15_0_DIO9_DISABLE           ((uint32_t)0x00000000U)         /* !< Edge detection disabled */
#define GPIO_POLARITY15_0_DIO9_RISE              ((uint32_t)0x00040000U)         /* !< Detects rising edge of input event */
#define GPIO_POLARITY15_0_DIO9_FALL              ((uint32_t)0x00080000U)         /* !< Detects falling edge of input event */
#define GPIO_POLARITY15_0_DIO9_RISE_FALL         ((uint32_t)0x000C0000U)         /* !< Detects both rising and falling
                                                                                    edge of input event */
/* GPIO_POLARITY15_0[DIO10] Bits */
#define GPIO_POLARITY15_0_DIO10_OFS              (20)                            /* !< DIO10 Offset */
#define GPIO_POLARITY15_0_DIO10_MASK             ((uint32_t)0x00300000U)         /* !< Enables and configures edge
                                                                                    detection polarity for DIO10. */
#define GPIO_POLARITY15_0_DIO10_DISABLE          ((uint32_t)0x00000000U)         /* !< Edge detection disabled */
#define GPIO_POLARITY15_0_DIO10_RISE             ((uint32_t)0x00100000U)         /* !< Detects rising edge of input event */
#define GPIO_POLARITY15_0_DIO10_FALL             ((uint32_t)0x00200000U)         /* !< Detects falling edge of input event */
#define GPIO_POLARITY15_0_DIO10_RISE_FALL        ((uint32_t)0x00300000U)         /* !< Detects both rising and falling
                                                                                    edge of input event */
/* GPIO_POLARITY15_0[DIO11] Bits */
#define GPIO_POLARITY15_0_DIO11_OFS              (22)                            /* !< DIO11 Offset */
#define GPIO_POLARITY15_0_DIO11_MASK             ((uint32_t)0x00C00000U)         /* !< Enables and configures edge
                                                                                    detection polarity for DIO11. */
#define GPIO_POLARITY15_0_DIO11_DISABLE          ((uint32_t)0x00000000U)         /* !< Edge detection disabled */
#define GPIO_POLARITY15_0_DIO11_RISE             ((uint32_t)0x00400000U)         /* !< Detects rising edge of input event */
#define GPIO_POLARITY15_0_DIO11_FALL             ((uint32_t)0x00800000U)         /* !< Detects falling edge of input event */
#define GPIO_POLARITY15_0_DIO11_RISE_FALL        ((uint32_t)0x00C00000U)         /* !< Detects both rising and falling
                                                                                    edge of input event */
/* GPIO_POLARITY15_0[DIO12] Bits */
#define GPIO_POLARITY15_0_DIO12_OFS              (24)                            /* !< DIO12 Offset */
#define GPIO_POLARITY15_0_DIO12_MASK             ((uint32_t)0x03000000U)         /* !< Enables and configures edge
                                                                                    detection polarity for DIO12. */
#define GPIO_POLARITY15_0_DIO12_DISABLE          ((uint32_t)0x00000000U)         /* !< Edge detection disabled */
#define GPIO_POLARITY15_0_DIO12_RISE             ((uint32_t)0x01000000U)         /* !< Detects rising edge of input event */
#define GPIO_POLARITY15_0_DIO12_FALL             ((uint32_t)0x02000000U)         /* !< Detects falling edge of input event */
#define GPIO_POLARITY15_0_DIO12_RISE_FALL        ((uint32_t)0x03000000U)         /* !< Detects both rising and falling
                                                                                    edge of input event */
/* GPIO_POLARITY15_0[DIO13] Bits */
#define GPIO_POLARITY15_0_DIO13_OFS              (26)                            /* !< DIO13 Offset */
#define GPIO_POLARITY15_0_DIO13_MASK             ((uint32_t)0x0C000000U)         /* !< Enables and configures edge
                                                                                    detection polarity for DIO13. */
#define GPIO_POLARITY15_0_DIO13_DISABLE          ((uint32_t)0x00000000U)         /* !< Edge detection disabled */
#define GPIO_POLARITY15_0_DIO13_RISE             ((uint32_t)0x04000000U)         /* !< Detects rising edge of input event */
#define GPIO_POLARITY15_0_DIO13_FALL             ((uint32_t)0x08000000U)         /* !< Detects falling edge of input event */
#define GPIO_POLARITY15_0_DIO13_RISE_FALL        ((uint32_t)0x0C000000U)         /* !< Detects both rising and falling
                                                                                    edge of input event */
/* GPIO_POLARITY15_0[DIO14] Bits */
#define GPIO_POLARITY15_0_DIO14_OFS              (28)                            /* !< DIO14 Offset */
#define GPIO_POLARITY15_0_DIO14_MASK             ((uint32_t)0x30000000U)         /* !< Enables and configures edge
                                                                                    detection polarity for DIO14. */
#define GPIO_POLARITY15_0_DIO14_DISABLE          ((uint32_t)0x00000000U)         /* !< Edge detection disabled */
#define GPIO_POLARITY15_0_DIO14_RISE             ((uint32_t)0x10000000U)         /* !< Detects rising edge of input event */
#define GPIO_POLARITY15_0_DIO14_FALL             ((uint32_t)0x20000000U)         /* !< Detects falling edge of input event */
#define GPIO_POLARITY15_0_DIO14_RISE_FALL        ((uint32_t)0x30000000U)         /* !< Detects both rising and falling
                                                                                    edge of input event */
/* GPIO_POLARITY15_0[DIO15] Bits */
#define GPIO_POLARITY15_0_DIO15_OFS              (30)                            /* !< DIO15 Offset */
#define GPIO_POLARITY15_0_DIO15_MASK             ((uint32_t)0xC0000000U)         /* !< Enables and configures edge
                                                                                    detection polarity for DIO15. */
#define GPIO_POLARITY15_0_DIO15_DISABLE          ((uint32_t)0x00000000U)         /* !< Edge detection disabled */
#define GPIO_POLARITY15_0_DIO15_RISE             ((uint32_t)0x40000000U)         /* !< Detects rising edge of input event */
#define GPIO_POLARITY15_0_DIO15_FALL             ((uint32_t)0x80000000U)         /* !< Detects falling edge of input event */
#define GPIO_POLARITY15_0_DIO15_RISE_FALL        ((uint32_t)0xC0000000U)         /* !< Detects both rising and falling
                                                                                    edge of input event */

