TexasInstruments/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/peripherals/hw_gpio.h
/* GPIO_POLARITY31_16 Bits */
/* GPIO_POLARITY31_16[DIO16] Bits */
#define GPIO_POLARITY31_16_DIO16_OFS             (0)                             /* !< DIO16 Offset */
#define GPIO_POLARITY31_16_DIO16_MASK            ((uint32_t)0x00000003U)         /* !< Enables and configures edge
                                                                                    detection polarity for DIO16. */
#define GPIO_POLARITY31_16_DIO16_DISABLE         ((uint32_t)0x00000000U)         /* !< Edge detection disabled */
#define GPIO_POLARITY31_16_DIO16_RISE            ((uint32_t)0x00000001U)         /* !< Detects rising edge of input event */
#define GPIO_POLARITY31_16_DIO16_FALL            ((uint32_t)0x00000002U)         /* !< Detects falling edge of input event */
#define GPIO_POLARITY31_16_DIO16_RISE_FALL       ((uint32_t)0x00000003U)         /* !< Detects both rising and falling
                                                                                    edge of input event */
/* GPIO_POLARITY31_16[DIO17] Bits */
#define GPIO_POLARITY31_16_DIO17_OFS             (2)                             /* !< DIO17 Offset */
#define GPIO_POLARITY31_16_DIO17_MASK            ((uint32_t)0x0000000CU)         /* !< Enables and configures edge
                                                                                    detection polarity for DIO17. */
#define GPIO_POLARITY31_16_DIO17_DISABLE         ((uint32_t)0x00000000U)         /* !< Edge detection disabled */
#define GPIO_POLARITY31_16_DIO17_RISE            ((uint32_t)0x00000004U)         /* !< Detects rising edge of input event */
#define GPIO_POLARITY31_16_DIO17_FALL            ((uint32_t)0x00000008U)         /* !< Detects falling edge of input event */
#define GPIO_POLARITY31_16_DIO17_RISE_FALL       ((uint32_t)0x0000000CU)         /* !< Detects both rising and falling
                                                                                    edge of input event */
/* GPIO_POLARITY31_16[DIO18] Bits */
#define GPIO_POLARITY31_16_DIO18_OFS             (4)                             /* !< DIO18 Offset */
#define GPIO_POLARITY31_16_DIO18_MASK            ((uint32_t)0x00000030U)         /* !< Enables and configures edge
                                                                                    detection polarity for DIO18. */
#define GPIO_POLARITY31_16_DIO18_DISABLE         ((uint32_t)0x00000000U)         /* !< Edge detection disabled */
#define GPIO_POLARITY31_16_DIO18_RISE            ((uint32_t)0x00000010U)         /* !< Detects rising edge of input event */
#define GPIO_POLARITY31_16_DIO18_FALL            ((uint32_t)0x00000020U)         /* !< Detects falling edge of input event */
#define GPIO_POLARITY31_16_DIO18_RISE_FALL       ((uint32_t)0x00000030U)         /* !< Detects both rising and falling
                                                                                    edge of input event */
/* GPIO_POLARITY31_16[DIO19] Bits */
#define GPIO_POLARITY31_16_DIO19_OFS             (6)                             /* !< DIO19 Offset */
#define GPIO_POLARITY31_16_DIO19_MASK            ((uint32_t)0x000000C0U)         /* !< Enables and configures edge
                                                                                    detection polarity for DIO19. */
#define GPIO_POLARITY31_16_DIO19_DISABLE         ((uint32_t)0x00000000U)         /* !< Edge detection disabled */
#define GPIO_POLARITY31_16_DIO19_RISE            ((uint32_t)0x00000040U)         /* !< Detects rising edge of input event */
#define GPIO_POLARITY31_16_DIO19_FALL            ((uint32_t)0x00000080U)         /* !< Detects falling edge of input event */
#define GPIO_POLARITY31_16_DIO19_RISE_FALL       ((uint32_t)0x000000C0U)         /* !< Detects both rising and falling
                                                                                    edge of input event */
/* GPIO_POLARITY31_16[DIO20] Bits */
#define GPIO_POLARITY31_16_DIO20_OFS             (8)                             /* !< DIO20 Offset */
#define GPIO_POLARITY31_16_DIO20_MASK            ((uint32_t)0x00000300U)         /* !< Enables and configures edge
                                                                                    detection polarity for DIO20. */
#define GPIO_POLARITY31_16_DIO20_DISABLE         ((uint32_t)0x00000000U)         /* !< Edge detection disabled */
#define GPIO_POLARITY31_16_DIO20_RISE            ((uint32_t)0x00000100U)         /* !< Detects rising edge of input event */
#define GPIO_POLARITY31_16_DIO20_FALL            ((uint32_t)0x00000200U)         /* !< Detects falling edge of input event */
#define GPIO_POLARITY31_16_DIO20_RISE_FALL       ((uint32_t)0x00000300U)         /* !< Detects both rising and falling
                                                                                    edge of input event */
/* GPIO_POLARITY31_16[DIO21] Bits */
#define GPIO_POLARITY31_16_DIO21_OFS             (10)                            /* !< DIO21 Offset */
#define GPIO_POLARITY31_16_DIO21_MASK            ((uint32_t)0x00000C00U)         /* !< Enables and configures edge
                                                                                    detection polarity for DIO21. */
#define GPIO_POLARITY31_16_DIO21_DISABLE         ((uint32_t)0x00000000U)         /* !< Edge detection disabled */
#define GPIO_POLARITY31_16_DIO21_RISE            ((uint32_t)0x00000400U)         /* !< Detects rising edge of input event */
#define GPIO_POLARITY31_16_DIO21_FALL            ((uint32_t)0x00000800U)         /* !< Detects falling edge of input event */
#define GPIO_POLARITY31_16_DIO21_RISE_FALL       ((uint32_t)0x00000C00U)         /* !< Detects both rising and falling
                                                                                    edge of input event */
/* GPIO_POLARITY31_16[DIO22] Bits */
#define GPIO_POLARITY31_16_DIO22_OFS             (12)                            /* !< DIO22 Offset */
#define GPIO_POLARITY31_16_DIO22_MASK            ((uint32_t)0x00003000U)         /* !< Enables and configures edge
                                                                                    detection polarity for DIO22. */
#define GPIO_POLARITY31_16_DIO22_DISABLE         ((uint32_t)0x00000000U)         /* !< Edge detection disabled */
#define GPIO_POLARITY31_16_DIO22_RISE            ((uint32_t)0x00001000U)         /* !< Detects rising edge of input event */
#define GPIO_POLARITY31_16_DIO22_FALL            ((uint32_t)0x00002000U)         /* !< Detects falling edge of input event */
#define GPIO_POLARITY31_16_DIO22_RISE_FALL       ((uint32_t)0x00003000U)         /* !< Detects both rising and falling
                                                                                    edge of input event */
/* GPIO_POLARITY31_16[DIO23] Bits */
#define GPIO_POLARITY31_16_DIO23_OFS             (14)                            /* !< DIO23 Offset */
#define GPIO_POLARITY31_16_DIO23_MASK            ((uint32_t)0x0000C000U)         /* !< Enables and configures edge
                                                                                    detection polarity for DIO23. */
#define GPIO_POLARITY31_16_DIO23_DISABLE         ((uint32_t)0x00000000U)         /* !< Edge detection disabled */
#define GPIO_POLARITY31_16_DIO23_RISE            ((uint32_t)0x00004000U)         /* !< Detects rising edge of input event */
#define GPIO_POLARITY31_16_DIO23_FALL            ((uint32_t)0x00008000U)         /* !< Detects falling edge of input event */
#define GPIO_POLARITY31_16_DIO23_RISE_FALL       ((uint32_t)0x0000C000U)         /* !< Detects both rising and falling
                                                                                    edge of input event */
/* GPIO_POLARITY31_16[DIO24] Bits */
#define GPIO_POLARITY31_16_DIO24_OFS             (16)                            /* !< DIO24 Offset */
#define GPIO_POLARITY31_16_DIO24_MASK            ((uint32_t)0x00030000U)         /* !< Enables and configures edge
                                                                                    detection polarity for DIO24. */
#define GPIO_POLARITY31_16_DIO24_DISABLE         ((uint32_t)0x00000000U)         /* !< Edge detection disabled */
#define GPIO_POLARITY31_16_DIO24_RISE            ((uint32_t)0x00010000U)         /* !< Detects rising edge of input event */
#define GPIO_POLARITY31_16_DIO24_FALL            ((uint32_t)0x00020000U)         /* !< Detects falling edge of input event */
#define GPIO_POLARITY31_16_DIO24_RISE_FALL       ((uint32_t)0x00030000U)         /* !< Detects both rising and falling
                                                                                    edge of input event */
/* GPIO_POLARITY31_16[DIO25] Bits */
#define GPIO_POLARITY31_16_DIO25_OFS             (18)                            /* !< DIO25 Offset */
#define GPIO_POLARITY31_16_DIO25_MASK            ((uint32_t)0x000C0000U)         /* !< Enables and configures edge
                                                                                    detection polarity for DIO25. */
#define GPIO_POLARITY31_16_DIO25_DISABLE         ((uint32_t)0x00000000U)         /* !< Edge detection disabled */
#define GPIO_POLARITY31_16_DIO25_RISE            ((uint32_t)0x00040000U)         /* !< Detects rising edge of input event */
#define GPIO_POLARITY31_16_DIO25_FALL            ((uint32_t)0x00080000U)         /* !< Detects falling edge of input event */
#define GPIO_POLARITY31_16_DIO25_RISE_FALL       ((uint32_t)0x000C0000U)         /* !< Detects both rising and falling
                                                                                    edge of input event */
/* GPIO_POLARITY31_16[DIO26] Bits */
#define GPIO_POLARITY31_16_DIO26_OFS             (20)                            /* !< DIO26 Offset */
#define GPIO_POLARITY31_16_DIO26_MASK            ((uint32_t)0x00300000U)         /* !< Enables and configures edge
                                                                                    detection polarity for DIO26. */
#define GPIO_POLARITY31_16_DIO26_DISABLE         ((uint32_t)0x00000000U)         /* !< Edge detection disabled */
#define GPIO_POLARITY31_16_DIO26_RISE            ((uint32_t)0x00100000U)         /* !< Detects rising edge of input event */
#define GPIO_POLARITY31_16_DIO26_FALL            ((uint32_t)0x00200000U)         /* !< Detects falling edge of input event */
#define GPIO_POLARITY31_16_DIO26_RISE_FALL       ((uint32_t)0x00300000U)         /* !< Detects both rising and falling
                                                                                    edge of input event */
/* GPIO_POLARITY31_16[DIO27] Bits */
#define GPIO_POLARITY31_16_DIO27_OFS             (22)                            /* !< DIO27 Offset */
#define GPIO_POLARITY31_16_DIO27_MASK            ((uint32_t)0x00C00000U)         /* !< Enables and configures edge
                                                                                    detection polarity for DIO27. */
#define GPIO_POLARITY31_16_DIO27_DISABLE         ((uint32_t)0x00000000U)         /* !< Edge detection disabled */
#define GPIO_POLARITY31_16_DIO27_RISE            ((uint32_t)0x00400000U)         /* !< Detects rising edge of input event */
#define GPIO_POLARITY31_16_DIO27_FALL            ((uint32_t)0x00800000U)         /* !< Detects falling edge of input event */
#define GPIO_POLARITY31_16_DIO27_RISE_FALL       ((uint32_t)0x00C00000U)         /* !< Detects both rising and falling
                                                                                    edge of input event */
/* GPIO_POLARITY31_16[DIO28] Bits */
#define GPIO_POLARITY31_16_DIO28_OFS             (24)                            /* !< DIO28 Offset */
#define GPIO_POLARITY31_16_DIO28_MASK            ((uint32_t)0x03000000U)         /* !< Enables and configures edge
                                                                                    detection polarity for DIO28. */
#define GPIO_POLARITY31_16_DIO28_DISABLE         ((uint32_t)0x00000000U)         /* !< Edge detection disabled */
#define GPIO_POLARITY31_16_DIO28_RISE            ((uint32_t)0x01000000U)         /* !< Detects rising edge of input event */
#define GPIO_POLARITY31_16_DIO28_FALL            ((uint32_t)0x02000000U)         /* !< Detects falling edge of input event */
#define GPIO_POLARITY31_16_DIO28_RISE_FALL       ((uint32_t)0x03000000U)         /* !< Detects both rising and falling
                                                                                    edge of input event */
/* GPIO_POLARITY31_16[DIO29] Bits */
#define GPIO_POLARITY31_16_DIO29_OFS             (26)                            /* !< DIO29 Offset */
#define GPIO_POLARITY31_16_DIO29_MASK            ((uint32_t)0x0C000000U)         /* !< Enables and configures edge
                                                                                    detection polarity for DIO29. */
#define GPIO_POLARITY31_16_DIO29_DISABLE         ((uint32_t)0x00000000U)         /* !< Edge detection disabled */
#define GPIO_POLARITY31_16_DIO29_RISE            ((uint32_t)0x04000000U)         /* !< Detects rising edge of input event */
#define GPIO_POLARITY31_16_DIO29_FALL            ((uint32_t)0x08000000U)         /* !< Detects falling edge of input event */
#define GPIO_POLARITY31_16_DIO29_RISE_FALL       ((uint32_t)0x0C000000U)         /* !< Detects both rising and falling
                                                                                    edge of input event */
/* GPIO_POLARITY31_16[DIO30] Bits */
#define GPIO_POLARITY31_16_DIO30_OFS             (28)                            /* !< DIO30 Offset */
#define GPIO_POLARITY31_16_DIO30_MASK            ((uint32_t)0x30000000U)         /* !< Enables and configures edge
                                                                                    detection polarity for DIO30. */
#define GPIO_POLARITY31_16_DIO30_DISABLE         ((uint32_t)0x00000000U)         /* !< Edge detection disabled */
#define GPIO_POLARITY31_16_DIO30_RISE            ((uint32_t)0x10000000U)         /* !< Detects rising edge of input event */
#define GPIO_POLARITY31_16_DIO30_FALL            ((uint32_t)0x20000000U)         /* !< Detects falling edge of input event */
#define GPIO_POLARITY31_16_DIO30_RISE_FALL       ((uint32_t)0x30000000U)         /* !< Detects both rising and falling
                                                                                    edge of input event */
/* GPIO_POLARITY31_16[DIO31] Bits */
#define GPIO_POLARITY31_16_DIO31_OFS             (30)                            /* !< DIO31 Offset */
#define GPIO_POLARITY31_16_DIO31_MASK            ((uint32_t)0xC0000000U)         /* !< Enables and configures edge
                                                                                    detection polarity for DIO31. */
#define GPIO_POLARITY31_16_DIO31_DISABLE         ((uint32_t)0x00000000U)         /* !< Edge detection disabled */
#define GPIO_POLARITY31_16_DIO31_RISE            ((uint32_t)0x40000000U)         /* !< Detects rising edge of input event */
#define GPIO_POLARITY31_16_DIO31_FALL            ((uint32_t)0x80000000U)         /* !< Detects falling edge of input event */
#define GPIO_POLARITY31_16_DIO31_RISE_FALL       ((uint32_t)0xC0000000U)         /* !< Detects both rising and falling
                                                                                    edge of input event */

