TexasInstruments/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/peripherals/hw_gpio.h
/* GPIO_CTL Bits */
/* GPIO_CTL[FASTWAKEONLY] Bits */
#define GPIO_CTL_FASTWAKEONLY_OFS                (0)                             /* !< FASTWAKEONLY Offset */
#define GPIO_CTL_FASTWAKEONLY_MASK               ((uint32_t)0x00000001U)         /* !< FASTWAKEONLY for the global control
                                                                                    of fastwake */
#define GPIO_CTL_FASTWAKEONLY_NOT_GLOBAL_EN      ((uint32_t)0x00000000U)         /* !< The global control of fastwake is
                                                                                    not enabled, per bit fast wake
                                                                                    feature depends on FASTWAKE.DIN */
#define GPIO_CTL_FASTWAKEONLY_GLOBAL_EN          ((uint32_t)0x00000001U)         /* !< The global control of fastwake is
                                                                                    enabled */

/* GPIO_FASTWAKE Bits */
/* GPIO_FASTWAKE[DIN0] Bits */
#define GPIO_FASTWAKE_DIN0_OFS                   (0)                             /* !< DIN0 Offset */
#define GPIO_FASTWAKE_DIN0_MASK                  ((uint32_t)0x00000001U)         /* !< Enable fastwake feature for DIN0 */
#define GPIO_FASTWAKE_DIN0_DISABLE               ((uint32_t)0x00000000U)         /* !< fastwake feature is disabled */
#define GPIO_FASTWAKE_DIN0_ENABLE                ((uint32_t)0x00000001U)         /* !< fastwake feature is enabled */
/* GPIO_FASTWAKE[DIN1] Bits */
#define GPIO_FASTWAKE_DIN1_OFS                   (1)                             /* !< DIN1 Offset */
#define GPIO_FASTWAKE_DIN1_MASK                  ((uint32_t)0x00000002U)         /* !< Enable fastwake feature for DIN1 */
#define GPIO_FASTWAKE_DIN1_DISABLE               ((uint32_t)0x00000000U)         /* !< fastwake feature is disabled */
#define GPIO_FASTWAKE_DIN1_ENABLE                ((uint32_t)0x00000002U)         /* !< fastwake feature is enabled */
/* GPIO_FASTWAKE[DIN2] Bits */
#define GPIO_FASTWAKE_DIN2_OFS                   (2)                             /* !< DIN2 Offset */
#define GPIO_FASTWAKE_DIN2_MASK                  ((uint32_t)0x00000004U)         /* !< Enable fastwake feature for DIN2 */
#define GPIO_FASTWAKE_DIN2_DISABLE               ((uint32_t)0x00000000U)         /* !< fastwake feature is disabled */
#define GPIO_FASTWAKE_DIN2_ENABLE                ((uint32_t)0x00000004U)         /* !< fastwake feature is enabled */
/* GPIO_FASTWAKE[DIN3] Bits */
#define GPIO_FASTWAKE_DIN3_OFS                   (3)                             /* !< DIN3 Offset */
#define GPIO_FASTWAKE_DIN3_MASK                  ((uint32_t)0x00000008U)         /* !< Enable fastwake feature for DIN3 */
#define GPIO_FASTWAKE_DIN3_DISABLE               ((uint32_t)0x00000000U)         /* !< fastwake feature is disabled */
#define GPIO_FASTWAKE_DIN3_ENABLE                ((uint32_t)0x00000008U)         /* !< fastwake feature is enabled */
/* GPIO_FASTWAKE[DIN4] Bits */
#define GPIO_FASTWAKE_DIN4_OFS                   (4)                             /* !< DIN4 Offset */
#define GPIO_FASTWAKE_DIN4_MASK                  ((uint32_t)0x00000010U)         /* !< Enable fastwake feature for DIN4 */
#define GPIO_FASTWAKE_DIN4_DISABLE               ((uint32_t)0x00000000U)         /* !< fastwake feature is disabled */
#define GPIO_FASTWAKE_DIN4_ENABLE                ((uint32_t)0x00000010U)         /* !< fastwake feature is enabled */
/* GPIO_FASTWAKE[DIN5] Bits */
#define GPIO_FASTWAKE_DIN5_OFS                   (5)                             /* !< DIN5 Offset */
#define GPIO_FASTWAKE_DIN5_MASK                  ((uint32_t)0x00000020U)         /* !< Enable fastwake feature for DIN5 */
#define GPIO_FASTWAKE_DIN5_DISABLE               ((uint32_t)0x00000000U)         /* !< fastwake feature is disabled */
#define GPIO_FASTWAKE_DIN5_ENABLE                ((uint32_t)0x00000020U)         /* !< fastwake feature is enabled */
/* GPIO_FASTWAKE[DIN6] Bits */
#define GPIO_FASTWAKE_DIN6_OFS                   (6)                             /* !< DIN6 Offset */
#define GPIO_FASTWAKE_DIN6_MASK                  ((uint32_t)0x00000040U)         /* !< Enable fastwake feature for DIN6 */
#define GPIO_FASTWAKE_DIN6_DISABLE               ((uint32_t)0x00000000U)         /* !< fastwake feature is disabled */
#define GPIO_FASTWAKE_DIN6_ENABLE                ((uint32_t)0x00000040U)         /* !< fastwake feature is enabled */
/* GPIO_FASTWAKE[DIN7] Bits */
#define GPIO_FASTWAKE_DIN7_OFS                   (7)                             /* !< DIN7 Offset */
#define GPIO_FASTWAKE_DIN7_MASK                  ((uint32_t)0x00000080U)         /* !< Enable fastwake feature for DIN7 */
#define GPIO_FASTWAKE_DIN7_DISABLE               ((uint32_t)0x00000000U)         /* !< fastwake feature is disabled */
#define GPIO_FASTWAKE_DIN7_ENABLE                ((uint32_t)0x00000080U)         /* !< fastwake feature is enabled */
/* GPIO_FASTWAKE[DIN8] Bits */
#define GPIO_FASTWAKE_DIN8_OFS                   (8)                             /* !< DIN8 Offset */
#define GPIO_FASTWAKE_DIN8_MASK                  ((uint32_t)0x00000100U)         /* !< Enable fastwake feature for DIN8 */
#define GPIO_FASTWAKE_DIN8_DISABLE               ((uint32_t)0x00000000U)         /* !< fastwake feature is disabled */
#define GPIO_FASTWAKE_DIN8_ENABLE                ((uint32_t)0x00000100U)         /* !< fastwake feature is enabled */
/* GPIO_FASTWAKE[DIN9] Bits */
#define GPIO_FASTWAKE_DIN9_OFS                   (9)                             /* !< DIN9 Offset */
#define GPIO_FASTWAKE_DIN9_MASK                  ((uint32_t)0x00000200U)         /* !< Enable fastwake feature for DIN9 */
#define GPIO_FASTWAKE_DIN9_DISABLE               ((uint32_t)0x00000000U)         /* !< fastwake feature is disabled */
#define GPIO_FASTWAKE_DIN9_ENABLE                ((uint32_t)0x00000200U)         /* !< fastwake feature is enabled */
/* GPIO_FASTWAKE[DIN10] Bits */
#define GPIO_FASTWAKE_DIN10_OFS                  (10)                            /* !< DIN10 Offset */
#define GPIO_FASTWAKE_DIN10_MASK                 ((uint32_t)0x00000400U)         /* !< Enable fastwake feature for DIN10 */
#define GPIO_FASTWAKE_DIN10_DISABLE              ((uint32_t)0x00000000U)         /* !< fastwake feature is disabled */
#define GPIO_FASTWAKE_DIN10_ENABLE               ((uint32_t)0x00000400U)         /* !< fastwake feature is enabled */
/* GPIO_FASTWAKE[DIN11] Bits */
#define GPIO_FASTWAKE_DIN11_OFS                  (11)                            /* !< DIN11 Offset */
#define GPIO_FASTWAKE_DIN11_MASK                 ((uint32_t)0x00000800U)         /* !< Enable fastwake feature for DIN11 */
#define GPIO_FASTWAKE_DIN11_DISABLE              ((uint32_t)0x00000000U)         /* !< fastwake feature is disabled */
#define GPIO_FASTWAKE_DIN11_ENABLE               ((uint32_t)0x00000800U)         /* !< fastwake feature is enabled */
/* GPIO_FASTWAKE[DIN12] Bits */
#define GPIO_FASTWAKE_DIN12_OFS                  (12)                            /* !< DIN12 Offset */
#define GPIO_FASTWAKE_DIN12_MASK                 ((uint32_t)0x00001000U)         /* !< Enable fastwake feature for DIN12 */
#define GPIO_FASTWAKE_DIN12_DISABLE              ((uint32_t)0x00000000U)         /* !< fastwake feature is disabled */
#define GPIO_FASTWAKE_DIN12_ENABLE               ((uint32_t)0x00001000U)         /* !< fastwake feature is enabled */
/* GPIO_FASTWAKE[DIN13] Bits */
#define GPIO_FASTWAKE_DIN13_OFS                  (13)                            /* !< DIN13 Offset */
#define GPIO_FASTWAKE_DIN13_MASK                 ((uint32_t)0x00002000U)         /* !< Enable fastwake feature for DIN13 */
#define GPIO_FASTWAKE_DIN13_DISABLE              ((uint32_t)0x00000000U)         /* !< fastwake feature is disabled */
#define GPIO_FASTWAKE_DIN13_ENABLE               ((uint32_t)0x00002000U)         /* !< fastwake feature is enabled */
/* GPIO_FASTWAKE[DIN14] Bits */
#define GPIO_FASTWAKE_DIN14_OFS                  (14)                            /* !< DIN14 Offset */
#define GPIO_FASTWAKE_DIN14_MASK                 ((uint32_t)0x00004000U)         /* !< Enable fastwake feature for DIN14 */
#define GPIO_FASTWAKE_DIN14_DISABLE              ((uint32_t)0x00000000U)         /* !< fastwake feature is disabled */
#define GPIO_FASTWAKE_DIN14_ENABLE               ((uint32_t)0x00004000U)         /* !< fastwake feature is enabled */
/* GPIO_FASTWAKE[DIN15] Bits */
#define GPIO_FASTWAKE_DIN15_OFS                  (15)                            /* !< DIN15 Offset */
#define GPIO_FASTWAKE_DIN15_MASK                 ((uint32_t)0x00008000U)         /* !< Enable fastwake feature for DIN15 */
#define GPIO_FASTWAKE_DIN15_DISABLE              ((uint32_t)0x00000000U)         /* !< fastwake feature is disabled */
#define GPIO_FASTWAKE_DIN15_ENABLE               ((uint32_t)0x00008000U)         /* !< fastwake feature is enabled */
/* GPIO_FASTWAKE[DIN16] Bits */
#define GPIO_FASTWAKE_DIN16_OFS                  (16)                            /* !< DIN16 Offset */
#define GPIO_FASTWAKE_DIN16_MASK                 ((uint32_t)0x00010000U)         /* !< Enable fastwake feature for DIN16 */
#define GPIO_FASTWAKE_DIN16_DISABLE              ((uint32_t)0x00000000U)         /* !< fastwake feature is disabled */
#define GPIO_FASTWAKE_DIN16_ENABLE               ((uint32_t)0x00010000U)         /* !< fastwake feature is enabled */
/* GPIO_FASTWAKE[DIN17] Bits */
#define GPIO_FASTWAKE_DIN17_OFS                  (17)                            /* !< DIN17 Offset */
#define GPIO_FASTWAKE_DIN17_MASK                 ((uint32_t)0x00020000U)         /* !< Enable fastwake feature for DIN17 */
#define GPIO_FASTWAKE_DIN17_DISABLE              ((uint32_t)0x00000000U)         /* !< fastwake feature is disabled */
#define GPIO_FASTWAKE_DIN17_ENABLE               ((uint32_t)0x00020000U)         /* !< fastwake feature is enabled */
/* GPIO_FASTWAKE[DIN18] Bits */
#define GPIO_FASTWAKE_DIN18_OFS                  (18)                            /* !< DIN18 Offset */
#define GPIO_FASTWAKE_DIN18_MASK                 ((uint32_t)0x00040000U)         /* !< Enable fastwake feature for DIN18 */
#define GPIO_FASTWAKE_DIN18_DISABLE              ((uint32_t)0x00000000U)         /* !< fastwake feature is disabled */
#define GPIO_FASTWAKE_DIN18_ENABLE               ((uint32_t)0x00040000U)         /* !< fastwake feature is enabled */
/* GPIO_FASTWAKE[DIN19] Bits */
#define GPIO_FASTWAKE_DIN19_OFS                  (19)                            /* !< DIN19 Offset */
#define GPIO_FASTWAKE_DIN19_MASK                 ((uint32_t)0x00080000U)         /* !< Enable fastwake feature for DIN19 */
#define GPIO_FASTWAKE_DIN19_DISABLE              ((uint32_t)0x00000000U)         /* !< fastwake feature is disabled */
#define GPIO_FASTWAKE_DIN19_ENABLE               ((uint32_t)0x00080000U)         /* !< fastwake feature is enabled */
/* GPIO_FASTWAKE[DIN20] Bits */
#define GPIO_FASTWAKE_DIN20_OFS                  (20)                            /* !< DIN20 Offset */
#define GPIO_FASTWAKE_DIN20_MASK                 ((uint32_t)0x00100000U)         /* !< Enable fastwake feature for DIN20 */
#define GPIO_FASTWAKE_DIN20_DISABLE              ((uint32_t)0x00000000U)         /* !< fastwake feature is disabled */
#define GPIO_FASTWAKE_DIN20_ENABLE               ((uint32_t)0x00100000U)         /* !< fastwake feature is enabled */
/* GPIO_FASTWAKE[DIN21] Bits */
#define GPIO_FASTWAKE_DIN21_OFS                  (21)                            /* !< DIN21 Offset */
#define GPIO_FASTWAKE_DIN21_MASK                 ((uint32_t)0x00200000U)         /* !< Enable fastwake feature for DIN21 */
#define GPIO_FASTWAKE_DIN21_DISABLE              ((uint32_t)0x00000000U)         /* !< fastwake feature is disabled */
#define GPIO_FASTWAKE_DIN21_ENABLE               ((uint32_t)0x00200000U)         /* !< fastwake feature is enabled */
/* GPIO_FASTWAKE[DIN22] Bits */
#define GPIO_FASTWAKE_DIN22_OFS                  (22)                            /* !< DIN22 Offset */
#define GPIO_FASTWAKE_DIN22_MASK                 ((uint32_t)0x00400000U)         /* !< Enable fastwake feature for DIN22 */
#define GPIO_FASTWAKE_DIN22_DISABLE              ((uint32_t)0x00000000U)         /* !< fastwake feature is disabled */
#define GPIO_FASTWAKE_DIN22_ENABLE               ((uint32_t)0x00400000U)         /* !< fastwake feature is enabled */
/* GPIO_FASTWAKE[DIN23] Bits */
#define GPIO_FASTWAKE_DIN23_OFS                  (23)                            /* !< DIN23 Offset */
#define GPIO_FASTWAKE_DIN23_MASK                 ((uint32_t)0x00800000U)         /* !< Enable fastwake feature for DIN23 */
#define GPIO_FASTWAKE_DIN23_DISABLE              ((uint32_t)0x00000000U)         /* !< fastwake feature is disabled */
#define GPIO_FASTWAKE_DIN23_ENABLE               ((uint32_t)0x00800000U)         /* !< fastwake feature is enabled */
/* GPIO_FASTWAKE[DIN24] Bits */
#define GPIO_FASTWAKE_DIN24_OFS                  (24)                            /* !< DIN24 Offset */
#define GPIO_FASTWAKE_DIN24_MASK                 ((uint32_t)0x01000000U)         /* !< Enable fastwake feature for DIN24 */
#define GPIO_FASTWAKE_DIN24_DISABLE              ((uint32_t)0x00000000U)         /* !< fastwake feature is disabled */
#define GPIO_FASTWAKE_DIN24_ENABLE               ((uint32_t)0x01000000U)         /* !< fastwake feature is enabled */
/* GPIO_FASTWAKE[DIN25] Bits */
#define GPIO_FASTWAKE_DIN25_OFS                  (25)                            /* !< DIN25 Offset */
#define GPIO_FASTWAKE_DIN25_MASK                 ((uint32_t)0x02000000U)         /* !< Enable fastwake feature for DIN25 */
#define GPIO_FASTWAKE_DIN25_DISABLE              ((uint32_t)0x00000000U)         /* !< fastwake feature is disabled */
#define GPIO_FASTWAKE_DIN25_ENABLE               ((uint32_t)0x02000000U)         /* !< fastwake feature is enabled */
/* GPIO_FASTWAKE[DIN26] Bits */
#define GPIO_FASTWAKE_DIN26_OFS                  (26)                            /* !< DIN26 Offset */
#define GPIO_FASTWAKE_DIN26_MASK                 ((uint32_t)0x04000000U)         /* !< Enable fastwake feature for DIN26 */
#define GPIO_FASTWAKE_DIN26_DISABLE              ((uint32_t)0x00000000U)         /* !< fastwake feature is disabled */
#define GPIO_FASTWAKE_DIN26_ENABLE               ((uint32_t)0x04000000U)         /* !< fastwake feature is enabled */
/* GPIO_FASTWAKE[DIN27] Bits */
#define GPIO_FASTWAKE_DIN27_OFS                  (27)                            /* !< DIN27 Offset */
#define GPIO_FASTWAKE_DIN27_MASK                 ((uint32_t)0x08000000U)         /* !< Enable fastwake feature for DIN27 */
#define GPIO_FASTWAKE_DIN27_DISABLE              ((uint32_t)0x00000000U)         /* !< fastwake feature is disabled */
#define GPIO_FASTWAKE_DIN27_ENABLE               ((uint32_t)0x08000000U)         /* !< fastwake feature is enabled */
/* GPIO_FASTWAKE[DIN28] Bits */
#define GPIO_FASTWAKE_DIN28_OFS                  (28)                            /* !< DIN28 Offset */
#define GPIO_FASTWAKE_DIN28_MASK                 ((uint32_t)0x10000000U)         /* !< Enable fastwake feature for DIN29 */
#define GPIO_FASTWAKE_DIN28_DISABLE              ((uint32_t)0x00000000U)         /* !< fastwake feature is disabled */
#define GPIO_FASTWAKE_DIN28_ENABLE               ((uint32_t)0x10000000U)         /* !< fastwake feature is enabled */
/* GPIO_FASTWAKE[DIN29] Bits */
#define GPIO_FASTWAKE_DIN29_OFS                  (29)                            /* !< DIN29 Offset */
#define GPIO_FASTWAKE_DIN29_MASK                 ((uint32_t)0x20000000U)         /* !< Enable fastwake feature for DIN29 */
#define GPIO_FASTWAKE_DIN29_DISABLE              ((uint32_t)0x00000000U)         /* !< fastwake feature is disabled */
#define GPIO_FASTWAKE_DIN29_ENABLE               ((uint32_t)0x20000000U)         /* !< fastwake feature is enabled */
/* GPIO_FASTWAKE[DIN30] Bits */
#define GPIO_FASTWAKE_DIN30_OFS                  (30)                            /* !< DIN30 Offset */
#define GPIO_FASTWAKE_DIN30_MASK                 ((uint32_t)0x40000000U)         /* !< Enable fastwake feature for DIN30 */
#define GPIO_FASTWAKE_DIN30_DISABLE              ((uint32_t)0x00000000U)         /* !< fastwake feature is disabled */
#define GPIO_FASTWAKE_DIN30_ENABLE               ((uint32_t)0x40000000U)         /* !< fastwake feature is enabled */
/* GPIO_FASTWAKE[DIN31] Bits */
#define GPIO_FASTWAKE_DIN31_OFS                  (31)                            /* !< DIN31 Offset */
#define GPIO_FASTWAKE_DIN31_MASK                 ((uint32_t)0x80000000U)         /* !< Enable fastwake feature for DIN31 */
#define GPIO_FASTWAKE_DIN31_DISABLE              ((uint32_t)0x00000000U)         /* !< fastwake feature is disabled */
#define GPIO_FASTWAKE_DIN31_ENABLE               ((uint32_t)0x80000000U)         /* !< fastwake feature is enabled */

/* GPIO_SUB0CFG Bits */
/* GPIO_SUB0CFG[ENABLE] Bits */
#define GPIO_SUB0CFG_ENABLE_OFS                  (0)                             /* !< ENABLE Offset */
#define GPIO_SUB0CFG_ENABLE_MASK                 ((uint32_t)0x00000001U)         /* !< This bit is used to enable
                                                                                    subscriber 0 event. */
#define GPIO_SUB0CFG_ENABLE_CLR                  ((uint32_t)0x00000000U)         /* !< Subscriber 0 event is disabled */
#define GPIO_SUB0CFG_ENABLE_SET                  ((uint32_t)0x00000001U)         /* !< Subscriber 0 event is enabled */
/* GPIO_SUB0CFG[OUTPOLICY] Bits */
#define GPIO_SUB0CFG_OUTPOLICY_OFS               (8)                             /* !< OUTPOLICY Offset */
#define GPIO_SUB0CFG_OUTPOLICY_MASK              ((uint32_t)0x00000300U)         /* !< These bits configure the output
                                                                                    policy for subscriber 0 event. */
#define GPIO_SUB0CFG_OUTPOLICY_SET               ((uint32_t)0x00000000U)         /* !< Selected DIO pins are set */
#define GPIO_SUB0CFG_OUTPOLICY_CLR               ((uint32_t)0x00000100U)         /* !< Selected DIO pins are cleared */
#define GPIO_SUB0CFG_OUTPOLICY_TOGGLE            ((uint32_t)0x00000200U)         /* !< Selected DIO pins are toggled */
/* GPIO_SUB0CFG[INDEX] Bits */
#define GPIO_SUB0CFG_INDEX_OFS                   (16)                            /* !< INDEX Offset */
#define GPIO_SUB0CFG_INDEX_MASK                  ((uint32_t)0x000F0000U)         /* !< Indicates the specific bit among
                                                                                    lower 16 bits that is targeted by the
                                                                                    subscriber action */
#define GPIO_SUB0CFG_INDEX_MIN                   ((uint32_t)0x00000000U)         /* !< specific bit targeted by the
                                                                                    subscriber action is bit0 */
#define GPIO_SUB0CFG_INDEX_MAX                   ((uint32_t)0x000F0000U)         /* !< specific bit targeted by the
                                                                                    subscriber action is bit15 */

